Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InteractionEvents
The Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InteractionEvents class contains the identifiers for interaction events.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InteractionEvents.HandleRolloverTest
Expected identification string for rollover and pre-selection events.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InteractionEvents.HandleHitTest
Expected identification string for handle hit test events.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InteractionEvents.HandleSelect
Expected identification string for handle select events.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InteractionEvents.HandleDragStarted
Expected identification string for handle drag started events.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InteractionEvents.HandleDragOngoing
Expected identification string for handle drag ongoing events.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InteractionEvents.HandleDragEnded
Expected identification string for handle drag ended events.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InteractionEvents.PopupMenuRequested
Expected identification string for pop-up menu request events.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InteractionEvents.DeleteSelectedObjects
Expected identification string for object deletion events.